Revit 2026 API

# RenderingQualitySettingsRenderDuration Property

---

A value that controls render duration.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RenderDuration RenderDuration { get; set; }
```
```vb
Public Property RenderDuration As RenderDuration
	Get
	Set
```
```cpp
public:
property RenderDuration RenderDuration {
	RenderDuration get ();
	void set (RenderDuration value);
}
```
```fsharp
member RenderDuration : RenderDuration with get, set
```

#### Property Value

RenderDuration

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value is not valid for RenderDuration. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

The duration of rendering.

#### Reference

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace